04_OpenFoam/_Tut_02/OpenFOAM-14/multiRegion/film/splashPanel/0/fluid/N2
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  14
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0/fluid";
    object      N2;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [];

internalField   uniform 0.77;

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"

    film
    {
        type            zeroGradient;
    }

    top
    {
        type            inletOutlet;
        inletValue      $internalField;
    }
}

// ************************************************************************* //
